app/views/paper/_show_paper_content.html.erb

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
        <!-- OKOK: 時區需要判斷  -->
        <%= t(:info_1) %> <%= news.user.first_name %> <%= t(:info_2) %>