app/controllers/news_controller.rb

  def show
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE ("news"."id" = 1) LIMIT 1

  def create
    @news = News.new(params[:news])
    user = User.find(session[:id])
    @news.user = user

    image = Image.create(:url => params[:image_url])
    image.news = @news
    image.save
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
INSERT INTO "images" ("news_id", "updated_at", "url", "created_at", "name") VALUES (NULL, '2011-06-08 03:50:55.089336', 'https://lh6.googleusercontent.com/-S-MyBSzsuHY/TXWT6NqERpI/AAAAAAAABIE/QHBIjNF96Sc/startuplive_logo.png', '2011-06-08 03:50:55.089336', NULL)
INSERT INTO "news" ("area", "rank", "hard_copy", "area_id", "news_id", "url", "created_at", "content", "updated_at", "title") VALUES (NULL, NULL, NULL, NULL, NULL, 'http://techorange.com/2011/06/02/watch-how-capital-inject/', '2011-06-02 06:24:00.597997', '當創投和天使投資人等專業投資者向新創公司招手的時候，這段募集資金的過程，對於大部分技術背景出身的團隊而言，除了被肯定的喜悅之外，還要面對一堆法律和財務專有名詞排山倒海而來的暈頭轉向，這成長的”資”味真是酸甜苦辣交織呢！資金怎麼拿？拿多少？本篇文章提供由 Fenwick & West 法律事務所針對網路，數位媒體和軟體產業整理的 2010 矽谷與西雅圖的天使/種子資金調查讓大家參考！', '2011-06-02 06:24:00.597997', '貼身觀察：資金注入新創公司的瞬間')
UPDATE "images" SET "updated_at" = '2011-06-07 08:00:21.354321', "news_id" = 1 WHERE ("images"."id" = 1)