app/controllers/paper_controller.rb

SELECT "tags".* FROM "tags"
---
  def index

    @m_reload_flag = false
    if(params[:m_login_flag]!=nil && params[:m_login_flag] == 'yes')
      @m_reload_flag = true
    end


    if (params[:type] != nil)
      session[:news_type] = params[:type]
    end

    if (session[:news_type] == nil)
      session[:news_type] = 'rank'
    end

    session[:friend_ranking_mode] = false

    if params[:page] != nil
      @news = get_news(session[:news_type], params[:page])
    else
      @news = get_news(session[:news_type], '1')
    end

    session[:news_load_time] = Time.now

    @tags = Tag.all

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "tag_filters" ON "tags".id = "tag_filters".tag_id WHERE (("tag_filters".user_id = 2))
---
  def load_filter_setting_from_db
        #load filter-setting from db
        user = User.find(session[:id])
        if(user == nil)
          # something wrong!
          set_tag_filter_by_locale
          return
        end

        # get tag filter (from user.tags)
        if(user.tags != [])
          session[:filter_tags] =""
          (user.tags).each do |tag|

INSERT INTO "areas" ("news_id", "primary_tag", "created_at", "updated_at", "name") VALUES (NULL, 'Taiwan', '2011-06-05 12:53:48.836003', '2011-06-05 12:53:48.836003', 'TW')
INSERT INTO "users" ("first_name", "email", "locale", "host_account", "updated_at", "birthday", "created_at", "host_id", "host_site", "last_name") VALUES ('Reporter', 'reporter.tw@heygotimes.com', 'zh_TW', NULL, '2011-06-05 17:44:03.658972', '2011-05-01 09:00:00.000000', '2011-06-05 17:44:03.658972', 0, 0, 'TW')
---
              sub_area_flag = true
            end

            user.areas << area  # many-to-many relationship ==> it would be saved to DB automatically

INSERT INTO "tags" ("checked", "updated_at", "parent_tag", "created_at", "name") VALUES (NULL, '2011-06-05 12:53:48.866371', NULL, '2011-06-05 12:53:48.866371', 'All')
---
        tags.each do |tag|

          if sub_area_flag == true && tag.name == 'Local'
            user.tags << tag

INSERT INTO "date_filters" ("user_id", "option", "date", "updated_at", "created_at") VALUES (NULL, 'selected_date', '2011-06-05 00:00:00.000000', '2011-06-07 09:13:23.226422', '2011-06-07 09:13:23.226422')
INSERT INTO "tag_filters" ("user_id", "updated_at", "tag_id", "created_at") VALUES (2, '2011-06-06 11:02:35.146292', 22, '2011-06-06 11:02:35.146292')
---
        # setup user.date_filter
        #
        temp_date_filter = DateFilter.new(:date => session[:filter_date], :option => session[:filter_date_option])
        temp_date_filter.save

INSERT INTO "friend_filters" ("user_id", "friend_filter_type") VALUES (NULL, 'mine/')
UPDATE "date_filters" SET "user_id" = 2, "updated_at" = '2011-06-07 02:56:21.776957' WHERE ("date_filters"."id" = 1)
UPDATE "friend_filters" SET "user_id" = 2 WHERE ("friend_filters"."id" = 1)
---
        #setup user.friend_filters
        temp_friend_filter = FriendFilter.new()
        temp_friend_filter.friend_filter_type = session[:filter_friend]
        temp_friend_filter.save
        user.friend_filter = temp_friend_filter

        user.save