app/controllers/real_time_news_controller.rb

SELECT "real_time_news".* FROM "real_time_news"
---
  def index
    @real_time_news = RealTimeNews.all

SELECT "real_time_news".* FROM "real_time_news" WHERE ("real_time_news"."id" = 1) LIMIT 1
---
  def show
    @real_time_news = RealTimeNews.find(params[:id])

INSERT INTO "real_time_news" ("title", "time", "area", "url", "created_at", "content", "updated_at", "tag") VALUES ('', '2011-05-09 06:03:00.000000', '', '', '2011-05-09 06:03:51.836806', '<p>ajsdasdnkjn</p>', '2011-05-09 06:03:51.836806', '')
---
  def create
    @real_time_news = RealTimeNews.new(params[:real_time_news])

    respond_to do |format|
      if @real_time_news.save