app/controllers/tag_controller.rb

  def get_all_tags
    tags = Tag.all
---
SELECT "tags".* FROM "tags"